// Напишите программу, которая принимает трехзначное число 
// и на выходе показывает его последнюю цифру.
Console.WriteLine("Введите трехзначное число!");
string input = Console.ReadLine();
int num = Convert.ToInt32(input);